Revit 2027 API
PaperSizeSet.Contains Method
Tests for the existence of an item within the set.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public virtual bool Contains(
	PaperSize item
)
Public Overridable Function Contains (
	item As PaperSize
) As Boolean
public:
virtual bool Contains(
	PaperSize^ item
)
abstract Contains :
        item : PaperSize -> bool
override Contains :
        item : PaperSize -> bool
Parameters
item PaperSize
The item to be searched for.
Return Value
Boolean
The Contains method returns True if the item is within the set, otherwise False.
See Also
Reference
PaperSizeSet Class
Autodesk.Revit.DB Namespace